// שאלה 21
// איזו טענה מבין הבאות נכונה בנוגע לקוד הבא:

#include<iostream>
using namespace std;
class A {
    int a1;
protected:
    int a2;
public:
    int a3;
};
class B : public A {};
class C : public B {
    void func() const {
        //...
    }
};

/*
תשובות אפשריות:
א. לפונקציה func אין גישה (קריאה/כתיבה) למשתנה a1 אך יש גישה למשתנים a2,a3
ב. לפונקציה func יש גישה (קריאה/כתיבה) לכל המשתנים: a1,a2,a3
ג. לפונקציה func אין גישה (קריאה/כתיבה) לכל המשתנים: a1,a2,a3
ד. לפונקציה func אין גישה (קריאה/כתיבה) למשתנים a1,a2 אך יש גישה למשתנה a3
ה. כל התשובות האחרות אינן נכונות
ו. לפונקציה func אין גישה (קריאה/כתיבה) למשתנים a1,a3 אך יש גישה למשתנה a2
*/