// שאלה 24
// נתונה תכנית עם קטעי קוד מושמטים.
// חלק מהקטעים המושמטים מסומנים בספרות רומיות: I ,II ו-III.
// בשורה 2 החלפנו את המילה public ב-protected וכעת יש בתכנית שורת קוד שלא עוברת
// קומפילציה באחד מהקטעים המושמטים. מה נכון לגבי הימצאות השורה שגורמת לשגיאת
// קומפילציה?

class A {
    ...
};

class B : public A {
    ... I ...
};

class C : public B {
    ... II ...
};

void main() {
    ... III ...
}

/*
(א) היא יכולה להימצא בקטע I
(ב) היא יכולה להימצא בקטע II אבל לא בקטעים I ו-III
(ג) היא יכולה להימצא בקטע III אבל לא בקטעים I ו-II
(ד) היא יכולה להימצא בקטעים II ו-III אבל לא בקטע I
*/
